zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43L43Z93/KW43L43Z93_COMMON.h
/* CRC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CRC_0 base address */
  #define CRC_0_BASE                               (0x50018000u)
  /** Peripheral CRC_0 base address */
  #define CRC_0_BASE_NS                            (0x40018000u)
  /** Peripheral CRC_0 base pointer */
  #define CRC_0                                    ((CRC_Type *)CRC_0_BASE)
  /** Peripheral CRC_0 base pointer */
  #define CRC_0_NS                                 ((CRC_Type *)CRC_0_BASE_NS)
  /** Peripheral CRC_1 base address */
  #define CRC_1_BASE                               (0x50019000u)
  /** Peripheral CRC_1 base address */
  #define CRC_1_BASE_NS                            (0x40019000u)
  /** Peripheral CRC_1 base pointer */
  #define CRC_1                                    ((CRC_Type *)CRC_1_BASE)
  /** Peripheral CRC_1 base pointer */
  #define CRC_1_NS                                 ((CRC_Type *)CRC_1_BASE_NS)
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS                           { CRC_0_BASE, CRC_1_BASE }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS                            { CRC_0, CRC_1 }
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS_NS                        { CRC_0_BASE_NS, CRC_1_BASE_NS }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS_NS                         { CRC_0_NS, CRC_1_NS }
#else
  /** Peripheral CRC_0 base address */
  #define CRC_0_BASE                               (0x40018000u)
  /** Peripheral CRC_0 base pointer */
  #define CRC_0                                    ((CRC_Type *)CRC_0_BASE)
  /** Peripheral CRC_1 base address */
  #define CRC_1_BASE                               (0x40019000u)
  /** Peripheral CRC_1 base pointer */
  #define CRC_1                                    ((CRC_Type *)CRC_1_BASE)
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS                           { CRC_0_BASE, CRC_1_BASE }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS                            { CRC_0, CRC_1 }
#endif

/* DIGTMP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral TDET_0 base address */
  #define TDET_0_BASE                              (0x501A2000u)
  /** Peripheral TDET_0 base address */
  #define TDET_0_BASE_NS                           (0x401A2000u)
  /** Peripheral TDET_0 base pointer */
  #define TDET_0                                   ((DIGTMP_Type *)TDET_0_BASE)
  /** Peripheral TDET_0 base pointer */
  #define TDET_0_NS                                ((DIGTMP_Type *)TDET_0_BASE_NS)
  /** Array initializer of DIGTMP peripheral base addresses */
  #define DIGTMP_BASE_ADDRS                        { TDET_0_BASE }
  /** Array initializer of DIGTMP peripheral base pointers */
  #define DIGTMP_BASE_PTRS                         { TDET_0 }
  /** Array initializer of DIGTMP peripheral base addresses */
  #define DIGTMP_BASE_ADDRS_NS                     { TDET_0_BASE_NS }
  /** Array initializer of DIGTMP peripheral base pointers */
  #define DIGTMP_BASE_PTRS_NS                      { TDET_0_NS }
#else
  /** Peripheral TDET_0 base address */
  #define TDET_0_BASE                              (0x401A2000u)
  /** Peripheral TDET_0 base pointer */
  #define TDET_0                                   ((DIGTMP_Type *)TDET_0_BASE)
  /** Array initializer of DIGTMP peripheral base addresses */
  #define DIGTMP_BASE_ADDRS                        { TDET_0_BASE }
  /** Array initializer of DIGTMP peripheral base pointers */
  #define DIGTMP_BASE_PTRS                         { TDET_0 }
#endif

/* DMA - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DMA0 base address */
  #define DMA0_BASE                                (0x501A4000u)
  /** Peripheral DMA0 base address */
  #define DMA0_BASE_NS                             (0x401A4000u)
  /** Peripheral DMA0 base pointer */
  #define DMA0                                     ((DMA_Type *)DMA0_BASE)
  /** Peripheral DMA0 base pointer */
  #define DMA0_NS                                  ((DMA_Type *)DMA0_BASE_NS)
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS                           { DMA0_BASE }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS                            { DMA0 }
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS_NS                        { DMA0_BASE_NS }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS_NS                         { DMA0_NS }
#else
  /** Peripheral DMA0 base address */
  #define DMA0_BASE                                (0x401A4000u)
  /** Peripheral DMA0 base pointer */
  #define DMA0                                     ((DMA_Type *)DMA0_BASE)
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS                           { DMA0_BASE }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS                            { DMA0 }
#endif
/** Interrupt vectors for the DMA peripheral type */
#define DMA_IRQS                                 { { DMA0_CH0_IRQn, DMA0_CH1_IRQn, DMA0_CH2_IRQn, DMA0_CH3_IRQn, DMA0_CH4_IRQn, DMA0_CH5_IRQn, DMA0_CH6_IRQn, DMA0_CH7_IRQn, DMA0_CH8_IRQn, DMA0_CH9_IRQn, DMA0_CH10_IRQn, DMA0_CH11_IRQn, DMA0_CH12_IRQn, DMA0_CH13_IRQn, DMA0_CH14_IRQn, DMA0_CH15_IRQn } }

/* DSB - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DSB_0 base address */
  #define DSB_0_BASE                               (0x50204000u)
  /** Peripheral DSB_0 base address */
  #define DSB_0_BASE_NS                            (0x40204000u)
  /** Peripheral DSB_0 base pointer */
  #define DSB_0                                    ((DSB_Type *)DSB_0_BASE)
  /** Peripheral DSB_0 base pointer */
  #define DSB_0_NS                                 ((DSB_Type *)DSB_0_BASE_NS)
  /** Array initializer of DSB peripheral base addresses */
  #define DSB_BASE_ADDRS                           { DSB_0_BASE }
  /** Array initializer of DSB peripheral base pointers */
  #define DSB_BASE_PTRS                            { DSB_0 }
  /** Array initializer of DSB peripheral base addresses */
  #define DSB_BASE_ADDRS_NS                        { DSB_0_BASE_NS }
  /** Array initializer of DSB peripheral base pointers */
  #define DSB_BASE_PTRS_NS                         { DSB_0_NS }
#else
  /** Peripheral DSB_0 base address */
  #define DSB_0_BASE                               (0x40204000u)
  /** Peripheral DSB_0 base pointer */
  #define DSB_0                                    ((DSB_Type *)DSB_0_BASE)
  /** Array initializer of DSB peripheral base addresses */
  #define DSB_BASE_ADDRS                           { DSB_0_BASE }
  /** Array initializer of DSB peripheral base pointers */
  #define DSB_BASE_PTRS                            { DSB_0 }
#endif

/* EWM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral EWM_0 base address */
  #define EWM_0_BASE                               (0x5019C000u)
  /** Peripheral EWM_0 base address */
  #define EWM_0_BASE_NS                            (0x4019C000u)
  /** Peripheral EWM_0 base pointer */
  #define EWM_0                                    ((EWM_Type *)EWM_0_BASE)
  /** Peripheral EWM_0 base pointer */
  #define EWM_0_NS                                 ((EWM_Type *)EWM_0_BASE_NS)
  /** Array initializer of EWM peripheral base addresses */
  #define EWM_BASE_ADDRS                           { EWM_0_BASE }
  /** Array initializer of EWM peripheral base pointers */
  #define EWM_BASE_PTRS                            { EWM_0 }
  /** Array initializer of EWM peripheral base addresses */
  #define EWM_BASE_ADDRS_NS                        { EWM_0_BASE_NS }
  /** Array initializer of EWM peripheral base pointers */
  #define EWM_BASE_PTRS_NS                         { EWM_0_NS }
#else
  /** Peripheral EWM_0 base address */
  #define EWM_0_BASE                               (0x4019C000u)
  /** Peripheral EWM_0 base pointer */
  #define EWM_0                                    ((EWM_Type *)EWM_0_BASE)
  /** Array initializer of EWM peripheral base addresses */
  #define EWM_BASE_ADDRS                           { EWM_0_BASE }
  /** Array initializer of EWM peripheral base pointers */
  #define EWM_BASE_PTRS                            { EWM_0 }
#endif
/** Interrupt vectors for the EWM peripheral type */
#define EWM_IRQS                                 { EWM0_IRQn }

/* FLASH_ARB_WRAP_SYN - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FLASH_ARB_WRAP_SYN base address */
  #define FLASH_ARB_WRAP_SYN_BASE                  (0x5001C000u)
  /** Peripheral FLASH_ARB_WRAP_SYN base address */
  #define FLASH_ARB_WRAP_SYN_BASE_NS               (0x4001C000u)
  /** Peripheral FLASH_ARB_WRAP_SYN base pointer */
  #define FLASH_ARB_WRAP_SYN                       ((FLASH_ARB_WRAP_SYN_Type *)FLASH_ARB_WRAP_SYN_BASE)
  /** Peripheral FLASH_ARB_WRAP_SYN base pointer */
  #define FLASH_ARB_WRAP_SYN_NS                    ((FLASH_ARB_WRAP_SYN_Type *)FLASH_ARB_WRAP_SYN_BASE_NS)
  /** Array initializer of FLASH_ARB_WRAP_SYN peripheral base addresses */
  #define FLASH_ARB_WRAP_SYN_BASE_ADDRS            { FLASH_ARB_WRAP_SYN_BASE }
  /** Array initializer of FLASH_ARB_WRAP_SYN peripheral base pointers */
  #define FLASH_ARB_WRAP_SYN_BASE_PTRS             { FLASH_ARB_WRAP_SYN }
  /** Array initializer of FLASH_ARB_WRAP_SYN peripheral base addresses */
  #define FLASH_ARB_WRAP_SYN_BASE_ADDRS_NS         { FLASH_ARB_WRAP_SYN_BASE_NS }
  /** Array initializer of FLASH_ARB_WRAP_SYN peripheral base pointers */
  #define FLASH_ARB_WRAP_SYN_BASE_PTRS_NS          { FLASH_ARB_WRAP_SYN_NS }
#else
  /** Peripheral FLASH_ARB_WRAP_SYN base address */
  #define FLASH_ARB_WRAP_SYN_BASE                  (0x4001C000u)
  /** Peripheral FLASH_ARB_WRAP_SYN base pointer */
  #define FLASH_ARB_WRAP_SYN                       ((FLASH_ARB_WRAP_SYN_Type *)FLASH_ARB_WRAP_SYN_BASE)
  /** Array initializer of FLASH_ARB_WRAP_SYN peripheral base addresses */
  #define FLASH_ARB_WRAP_SYN_BASE_ADDRS            { FLASH_ARB_WRAP_SYN_BASE }
  /** Array initializer of FLASH_ARB_WRAP_SYN peripheral base pointers */
  #define FLASH_ARB_WRAP_SYN_BASE_PTRS             { FLASH_ARB_WRAP_SYN }
#endif

/* FMU - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FMU base address */
  #define FMU_BASE                                 (0x50017000u)
  /** Peripheral FMU base address */
  #define FMU_BASE_NS                              (0x40017000u)
  /** Peripheral FMU base pointer */
  #define FMU                                      ((FMU_Type *)FMU_BASE)
  /** Peripheral FMU base pointer */
  #define FMU_NS                                   ((FMU_Type *)FMU_BASE_NS)
  /** Array initializer of FMU peripheral base addresses */
  #define FMU_BASE_ADDRS                           { FMU_BASE }
  /** Array initializer of FMU peripheral base pointers */
  #define FMU_BASE_PTRS                            { FMU }
  /** Array initializer of FMU peripheral base addresses */
  #define FMU_BASE_ADDRS_NS                        { FMU_BASE_NS }
  /** Array initializer of FMU peripheral base pointers */
  #define FMU_BASE_PTRS_NS                         { FMU_NS }
#else
  /** Peripheral FMU base address */
  #define FMU_BASE                                 (0x40017000u)
  /** Peripheral FMU base pointer */
  #define FMU                                      ((FMU_Type *)FMU_BASE)
  /** Array initializer of FMU peripheral base addresses */
  #define FMU_BASE_ADDRS                           { FMU_BASE }
  /** Array initializer of FMU peripheral base pointers */
  #define FMU_BASE_PTRS                            { FMU }
#endif

/* FRO200M - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FRO200M base address */
  #define FRO200M_BASE                             (0x50024000u)
  /** Peripheral FRO200M base address */
  #define FRO200M_BASE_NS                          (0x40024000u)
  /** Peripheral FRO200M base pointer */
  #define FRO200M                                  ((FRO200M_Type *)FRO200M_BASE)
  /** Peripheral FRO200M base pointer */
  #define FRO200M_NS                               ((FRO200M_Type *)FRO200M_BASE_NS)
  /** Array initializer of FRO200M peripheral base addresses */
  #define FRO200M_BASE_ADDRS                       { FRO200M_BASE }
  /** Array initializer of FRO200M peripheral base pointers */
  #define FRO200M_BASE_PTRS                        { FRO200M }
  /** Array initializer of FRO200M peripheral base addresses */
  #define FRO200M_BASE_ADDRS_NS                    { FRO200M_BASE_NS }
  /** Array initializer of FRO200M peripheral base pointers */
  #define FRO200M_BASE_PTRS_NS                     { FRO200M_NS }
#else
  /** Peripheral FRO200M base address */
  #define FRO200M_BASE                             (0x40024000u)
  /** Peripheral FRO200M base pointer */
  #define FRO200M                                  ((FRO200M_Type *)FRO200M_BASE)
  /** Array initializer of FRO200M peripheral base addresses */
  #define FRO200M_BASE_ADDRS                       { FRO200M_BASE }
  /** Array initializer of FRO200M peripheral base pointers */
  #define FRO200M_BASE_PTRS                        { FRO200M }
#endif

/* GDET - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DGDET0 base address */
  #define DGDET0_BASE                              (0x50039000u)
  /** Peripheral DGDET0 base address */
  #define DGDET0_BASE_NS                           (0x40039000u)
  /** Peripheral DGDET0 base pointer */
  #define DGDET0                                   ((GDET_Type *)DGDET0_BASE)
  /** Peripheral DGDET0 base pointer */
  #define DGDET0_NS                                ((GDET_Type *)DGDET0_BASE_NS)
  /** Array initializer of GDET peripheral base addresses */
  #define GDET_BASE_ADDRS                          { DGDET0_BASE }
  /** Array initializer of GDET peripheral base pointers */
  #define GDET_BASE_PTRS                           { DGDET0 }
  /** Array initializer of GDET peripheral base addresses */
  #define GDET_BASE_ADDRS_NS                       { DGDET0_BASE_NS }
  /** Array initializer of GDET peripheral base pointers */
  #define GDET_BASE_PTRS_NS                        { DGDET0_NS }
#else
  /** Peripheral DGDET0 base address */
  #define DGDET0_BASE                              (0x40039000u)
  /** Peripheral DGDET0 base pointer */
  #define DGDET0                                   ((GDET_Type *)DGDET0_BASE)
  /** Array initializer of GDET peripheral base addresses */
  #define GDET_BASE_ADDRS                          { DGDET0_BASE }
  /** Array initializer of GDET peripheral base pointers */
  #define GDET_BASE_PTRS                           { DGDET0 }
#endif

/* GEN4PHY - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral XCVR_2P4GHZ_PHY base address */
  #define XCVR_2P4GHZ_PHY_BASE                     (0x50107600u)
  /** Peripheral XCVR_2P4GHZ_PHY base address */
  #define XCVR_2P4GHZ_PHY_BASE_NS                  (0x40107600u)
  /** Peripheral XCVR_2P4GHZ_PHY base pointer */
  #define XCVR_2P4GHZ_PHY                          ((GEN4PHY_Type *)XCVR_2P4GHZ_PHY_BASE)
  /** Peripheral XCVR_2P4GHZ_PHY base pointer */
  #define XCVR_2P4GHZ_PHY_NS                       ((GEN4PHY_Type *)XCVR_2P4GHZ_PHY_BASE_NS)
  /** Array initializer of GEN4PHY peripheral base addresses */
  #define GEN4PHY_BASE_ADDRS                       { XCVR_2P4GHZ_PHY_BASE }
  /** Array initializer of GEN4PHY peripheral base pointers */
  #define GEN4PHY_BASE_PTRS                        { XCVR_2P4GHZ_PHY }
  /** Array initializer of GEN4PHY peripheral base addresses */
  #define GEN4PHY_BASE_ADDRS_NS                    { XCVR_2P4GHZ_PHY_BASE_NS }
  /** Array initializer of GEN4PHY peripheral base pointers */
  #define GEN4PHY_BASE_PTRS_NS                     { XCVR_2P4GHZ_PHY_NS }
#else
  /** Peripheral XCVR_2P4GHZ_PHY base address */
  #define XCVR_2P4GHZ_PHY_BASE                     (0x40107600u)
  /** Peripheral XCVR_2P4GHZ_PHY base pointer */
  #define XCVR_2P4GHZ_PHY                          ((GEN4PHY_Type *)XCVR_2P4GHZ_PHY_BASE)
  /** Array initializer of GEN4PHY peripheral base addresses */
  #define GEN4PHY_BASE_ADDRS                       { XCVR_2P4GHZ_PHY_BASE }
  /** Array initializer of GEN4PHY peripheral base pointers */
  #define GEN4PHY_BASE_PTRS                        { XCVR_2P4GHZ_PHY }
#endif

/* GENFSK - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral GENFSK base address */
  #define GENFSK_BASE                              (0x50102000u)
  /** Peripheral GENFSK base address */
  #define GENFSK_BASE_NS                           (0x40102000u)
  /** Peripheral GENFSK base pointer */
  #define GENFSK                                   ((GENFSK_Type *)GENFSK_BASE)
  /** Peripheral GENFSK base pointer */
  #define GENFSK_NS                                ((GENFSK_Type *)GENFSK_BASE_NS)
  /** Array initializer of GENFSK peripheral base addresses */
  #define GENFSK_BASE_ADDRS                        { GENFSK_BASE }
  /** Array initializer of GENFSK peripheral base pointers */
  #define GENFSK_BASE_PTRS                         { GENFSK }
  /** Array initializer of GENFSK peripheral base addresses */
  #define GENFSK_BASE_ADDRS_NS                     { GENFSK_BASE_NS }
  /** Array initializer of GENFSK peripheral base pointers */
  #define GENFSK_BASE_PTRS_NS                      { GENFSK_NS }
#else
  /** Peripheral GENFSK base address */
  #define GENFSK_BASE                              (0x40102000u)
  /** Peripheral GENFSK base pointer */
  #define GENFSK                                   ((GENFSK_Type *)GENFSK_BASE)
  /** Array initializer of GENFSK peripheral base addresses */
  #define GENFSK_BASE_ADDRS                        { GENFSK_BASE }
  /** Array initializer of GENFSK peripheral base pointers */
  #define GENFSK_BASE_PTRS                         { GENFSK }
#endif

